name: "densenet121"
op {
  input: "data"
  input: "conv1_w"
  output: "conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 2
  }
  arg {
    name: "pad"
    i: 3
  }
  arg {
    name: "kernel"
    i: 7
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv1"
  input: "conv1/bn_scale"
  input: "conv1/bn_bias"
  input: "conv1/bn_mean"
  input: "conv1/bn_var"
  output: "conv1/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv1/bn"
  input: "conv1/bn_w"
  output: "conv1/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv1/bn_internal"
  input: "conv1/bn_b"
  output: "conv1/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv1/bn"
  output: "conv1/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv1/bn"
  output: "pool1"
  type: "MaxPool"
  arg {
    name: "stride"
    i: 2
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  device_option {
  }
  engine: ""
}
op {
  input: "pool1"
  input: "conv2_1/x1/bn_scale"
  input: "conv2_1/x1/bn_bias"
  input: "conv2_1/x1/bn_mean"
  input: "conv2_1/x1/bn_var"
  output: "conv2_1/x1/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_1/x1/bn"
  input: "conv2_1/x1/bn_w"
  output: "conv2_1/x1/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_1/x1/bn_internal"
  input: "conv2_1/x1/bn_b"
  output: "conv2_1/x1/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_1/x1/bn"
  output: "conv2_1/x1/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_1/x1/bn"
  input: "conv2_1/x1_w"
  output: "conv2_1/x1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_1/x1"
  input: "conv2_1/x2/bn_scale"
  input: "conv2_1/x2/bn_bias"
  input: "conv2_1/x2/bn_mean"
  input: "conv2_1/x2/bn_var"
  output: "conv2_1/x2/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_1/x2/bn"
  input: "conv2_1/x2/bn_w"
  output: "conv2_1/x2/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_1/x2/bn_internal"
  input: "conv2_1/x2/bn_b"
  output: "conv2_1/x2/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_1/x2/bn"
  output: "conv2_1/x2/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_1/x2/bn"
  input: "conv2_1/x2_w"
  output: "conv2_1/x2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  device_option {
  }
  engine: ""
}
op {
  input: "pool1"
  input: "conv2_1/x2"
  output: "concat_2_1"
  output: "_concat_2_1_dims"
  type: "Concat"
  device_option {
  }
  engine: ""
}
op {
  input: "concat_2_1"
  input: "conv2_2/x1/bn_scale"
  input: "conv2_2/x1/bn_bias"
  input: "conv2_2/x1/bn_mean"
  input: "conv2_2/x1/bn_var"
  output: "conv2_2/x1/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_2/x1/bn"
  input: "conv2_2/x1/bn_w"
  output: "conv2_2/x1/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_2/x1/bn_internal"
  input: "conv2_2/x1/bn_b"
  output: "conv2_2/x1/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_2/x1/bn"
  output: "conv2_2/x1/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_2/x1/bn"
  input: "conv2_2/x1_w"
  output: "conv2_2/x1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_2/x1"
  input: "conv2_2/x2/bn_scale"
  input: "conv2_2/x2/bn_bias"
  input: "conv2_2/x2/bn_mean"
  input: "conv2_2/x2/bn_var"
  output: "conv2_2/x2/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_2/x2/bn"
  input: "conv2_2/x2/bn_w"
  output: "conv2_2/x2/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_2/x2/bn_internal"
  input: "conv2_2/x2/bn_b"
  output: "conv2_2/x2/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_2/x2/bn"
  output: "conv2_2/x2/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_2/x2/bn"
  input: "conv2_2/x2_w"
  output: "conv2_2/x2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  device_option {
  }
  engine: ""
}
op {
  input: "concat_2_1"
  input: "conv2_2/x2"
  output: "concat_2_2"
  output: "_concat_2_2_dims"
  type: "Concat"
  device_option {
  }
  engine: ""
}
op {
  input: "concat_2_2"
  input: "conv2_3/x1/bn_scale"
  input: "conv2_3/x1/bn_bias"
  input: "conv2_3/x1/bn_mean"
  input: "conv2_3/x1/bn_var"
  output: "conv2_3/x1/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_3/x1/bn"
  input: "conv2_3/x1/bn_w"
  output: "conv2_3/x1/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_3/x1/bn_internal"
  input: "conv2_3/x1/bn_b"
  output: "conv2_3/x1/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_3/x1/bn"
  output: "conv2_3/x1/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_3/x1/bn"
  input: "conv2_3/x1_w"
  output: "conv2_3/x1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_3/x1"
  input: "conv2_3/x2/bn_scale"
  input: "conv2_3/x2/bn_bias"
  input: "conv2_3/x2/bn_mean"
  input: "conv2_3/x2/bn_var"
  output: "conv2_3/x2/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_3/x2/bn"
  input: "conv2_3/x2/bn_w"
  output: "conv2_3/x2/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_3/x2/bn_internal"
  input: "conv2_3/x2/bn_b"
  output: "conv2_3/x2/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_3/x2/bn"
  output: "conv2_3/x2/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_3/x2/bn"
  input: "conv2_3/x2_w"
  output: "conv2_3/x2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  device_option {
  }
  engine: ""
}
op {
  input: "concat_2_2"
  input: "conv2_3/x2"
  output: "concat_2_3"
  output: "_concat_2_3_dims"
  type: "Concat"
  device_option {
  }
  engine: ""
}
op {
  input: "concat_2_3"
  input: "conv2_4/x1/bn_scale"
  input: "conv2_4/x1/bn_bias"
  input: "conv2_4/x1/bn_mean"
  input: "conv2_4/x1/bn_var"
  output: "conv2_4/x1/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_4/x1/bn"
  input: "conv2_4/x1/bn_w"
  output: "conv2_4/x1/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_4/x1/bn_internal"
  input: "conv2_4/x1/bn_b"
  output: "conv2_4/x1/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_4/x1/bn"
  output: "conv2_4/x1/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_4/x1/bn"
  input: "conv2_4/x1_w"
  output: "conv2_4/x1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_4/x1"
  input: "conv2_4/x2/bn_scale"
  input: "conv2_4/x2/bn_bias"
  input: "conv2_4/x2/bn_mean"
  input: "conv2_4/x2/bn_var"
  output: "conv2_4/x2/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_4/x2/bn"
  input: "conv2_4/x2/bn_w"
  output: "conv2_4/x2/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_4/x2/bn_internal"
  input: "conv2_4/x2/bn_b"
  output: "conv2_4/x2/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_4/x2/bn"
  output: "conv2_4/x2/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_4/x2/bn"
  input: "conv2_4/x2_w"
  output: "conv2_4/x2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  device_option {
  }
  engine: ""
}
op {
  input: "concat_2_3"
  input: "conv2_4/x2"
  output: "concat_2_4"
  output: "_concat_2_4_dims"
  type: "Concat"
  device_option {
  }
  engine: ""
}
op {
  input: "concat_2_4"
  input: "conv2_5/x1/bn_scale"
  input: "conv2_5/x1/bn_bias"
  input: "conv2_5/x1/bn_mean"
  input: "conv2_5/x1/bn_var"
  output: "conv2_5/x1/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_5/x1/bn"
  input: "conv2_5/x1/bn_w"
  output: "conv2_5/x1/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_5/x1/bn_internal"
  input: "conv2_5/x1/bn_b"
  output: "conv2_5/x1/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_5/x1/bn"
  output: "conv2_5/x1/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_5/x1/bn"
  input: "conv2_5/x1_w"
  output: "conv2_5/x1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_5/x1"
  input: "conv2_5/x2/bn_scale"
  input: "conv2_5/x2/bn_bias"
  input: "conv2_5/x2/bn_mean"
  input: "conv2_5/x2/bn_var"
  output: "conv2_5/x2/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_5/x2/bn"
  input: "conv2_5/x2/bn_w"
  output: "conv2_5/x2/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_5/x2/bn_internal"
  input: "conv2_5/x2/bn_b"
  output: "conv2_5/x2/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_5/x2/bn"
  output: "conv2_5/x2/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_5/x2/bn"
  input: "conv2_5/x2_w"
  output: "conv2_5/x2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  device_option {
  }
  engine: ""
}
op {
  input: "concat_2_4"
  input: "conv2_5/x2"
  output: "concat_2_5"
  output: "_concat_2_5_dims"
  type: "Concat"
  device_option {
  }
  engine: ""
}
op {
  input: "concat_2_5"
  input: "conv2_6/x1/bn_scale"
  input: "conv2_6/x1/bn_bias"
  input: "conv2_6/x1/bn_mean"
  input: "conv2_6/x1/bn_var"
  output: "conv2_6/x1/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_6/x1/bn"
  input: "conv2_6/x1/bn_w"
  output: "conv2_6/x1/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_6/x1/bn_internal"
  input: "conv2_6/x1/bn_b"
  output: "conv2_6/x1/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_6/x1/bn"
  output: "conv2_6/x1/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_6/x1/bn"
  input: "conv2_6/x1_w"
  output: "conv2_6/x1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_6/x1"
  input: "conv2_6/x2/bn_scale"
  input: "conv2_6/x2/bn_bias"
  input: "conv2_6/x2/bn_mean"
  input: "conv2_6/x2/bn_var"
  output: "conv2_6/x2/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_6/x2/bn"
  input: "conv2_6/x2/bn_w"
  output: "conv2_6/x2/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_6/x2/bn_internal"
  input: "conv2_6/x2/bn_b"
  output: "conv2_6/x2/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_6/x2/bn"
  output: "conv2_6/x2/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_6/x2/bn"
  input: "conv2_6/x2_w"
  output: "conv2_6/x2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  device_option {
  }
  engine: ""
}
op {
  input: "concat_2_5"
  input: "conv2_6/x2"
  output: "concat_2_6"
  output: "_concat_2_6_dims"
  type: "Concat"
  device_option {
  }
  engine: ""
}
op {
  input: "concat_2_6"
  input: "conv2_blk/bn_scale"
  input: "conv2_blk/bn_bias"
  input: "conv2_blk/bn_mean"
  input: "conv2_blk/bn_var"
  output: "conv2_blk/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_blk/bn"
  input: "conv2_blk/bn_w"
  output: "conv2_blk/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_blk/bn_internal"
  input: "conv2_blk/bn_b"
  output: "conv2_blk/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_blk/bn"
  output: "conv2_blk/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_blk/bn"
  input: "conv2_blk_w"
  output: "conv2_blk"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv2_blk"
  output: "pool2"
  type: "AveragePool"
  arg {
    name: "stride"
    i: 2
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 2
  }
  device_option {
  }
  engine: ""
}
op {
  input: "pool2"
  input: "conv3_1/x1/bn_scale"
  input: "conv3_1/x1/bn_bias"
  input: "conv3_1/x1/bn_mean"
  input: "conv3_1/x1/bn_var"
  output: "conv3_1/x1/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_1/x1/bn"
  input: "conv3_1/x1/bn_w"
  output: "conv3_1/x1/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_1/x1/bn_internal"
  input: "conv3_1/x1/bn_b"
  output: "conv3_1/x1/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_1/x1/bn"
  output: "conv3_1/x1/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_1/x1/bn"
  input: "conv3_1/x1_w"
  output: "conv3_1/x1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_1/x1"
  input: "conv3_1/x2/bn_scale"
  input: "conv3_1/x2/bn_bias"
  input: "conv3_1/x2/bn_mean"
  input: "conv3_1/x2/bn_var"
  output: "conv3_1/x2/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_1/x2/bn"
  input: "conv3_1/x2/bn_w"
  output: "conv3_1/x2/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_1/x2/bn_internal"
  input: "conv3_1/x2/bn_b"
  output: "conv3_1/x2/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_1/x2/bn"
  output: "conv3_1/x2/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_1/x2/bn"
  input: "conv3_1/x2_w"
  output: "conv3_1/x2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  device_option {
  }
  engine: ""
}
op {
  input: "pool2"
  input: "conv3_1/x2"
  output: "concat_3_1"
  output: "_concat_3_1_dims"
  type: "Concat"
  device_option {
  }
  engine: ""
}
op {
  input: "concat_3_1"
  input: "conv3_2/x1/bn_scale"
  input: "conv3_2/x1/bn_bias"
  input: "conv3_2/x1/bn_mean"
  input: "conv3_2/x1/bn_var"
  output: "conv3_2/x1/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_2/x1/bn"
  input: "conv3_2/x1/bn_w"
  output: "conv3_2/x1/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_2/x1/bn_internal"
  input: "conv3_2/x1/bn_b"
  output: "conv3_2/x1/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_2/x1/bn"
  output: "conv3_2/x1/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_2/x1/bn"
  input: "conv3_2/x1_w"
  output: "conv3_2/x1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_2/x1"
  input: "conv3_2/x2/bn_scale"
  input: "conv3_2/x2/bn_bias"
  input: "conv3_2/x2/bn_mean"
  input: "conv3_2/x2/bn_var"
  output: "conv3_2/x2/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_2/x2/bn"
  input: "conv3_2/x2/bn_w"
  output: "conv3_2/x2/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_2/x2/bn_internal"
  input: "conv3_2/x2/bn_b"
  output: "conv3_2/x2/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_2/x2/bn"
  output: "conv3_2/x2/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_2/x2/bn"
  input: "conv3_2/x2_w"
  output: "conv3_2/x2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  device_option {
  }
  engine: ""
}
op {
  input: "concat_3_1"
  input: "conv3_2/x2"
  output: "concat_3_2"
  output: "_concat_3_2_dims"
  type: "Concat"
  device_option {
  }
  engine: ""
}
op {
  input: "concat_3_2"
  input: "conv3_3/x1/bn_scale"
  input: "conv3_3/x1/bn_bias"
  input: "conv3_3/x1/bn_mean"
  input: "conv3_3/x1/bn_var"
  output: "conv3_3/x1/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_3/x1/bn"
  input: "conv3_3/x1/bn_w"
  output: "conv3_3/x1/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_3/x1/bn_internal"
  input: "conv3_3/x1/bn_b"
  output: "conv3_3/x1/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_3/x1/bn"
  output: "conv3_3/x1/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_3/x1/bn"
  input: "conv3_3/x1_w"
  output: "conv3_3/x1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_3/x1"
  input: "conv3_3/x2/bn_scale"
  input: "conv3_3/x2/bn_bias"
  input: "conv3_3/x2/bn_mean"
  input: "conv3_3/x2/bn_var"
  output: "conv3_3/x2/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_3/x2/bn"
  input: "conv3_3/x2/bn_w"
  output: "conv3_3/x2/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_3/x2/bn_internal"
  input: "conv3_3/x2/bn_b"
  output: "conv3_3/x2/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_3/x2/bn"
  output: "conv3_3/x2/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_3/x2/bn"
  input: "conv3_3/x2_w"
  output: "conv3_3/x2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  device_option {
  }
  engine: ""
}
op {
  input: "concat_3_2"
  input: "conv3_3/x2"
  output: "concat_3_3"
  output: "_concat_3_3_dims"
  type: "Concat"
  device_option {
  }
  engine: ""
}
op {
  input: "concat_3_3"
  input: "conv3_4/x1/bn_scale"
  input: "conv3_4/x1/bn_bias"
  input: "conv3_4/x1/bn_mean"
  input: "conv3_4/x1/bn_var"
  output: "conv3_4/x1/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_4/x1/bn"
  input: "conv3_4/x1/bn_w"
  output: "conv3_4/x1/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_4/x1/bn_internal"
  input: "conv3_4/x1/bn_b"
  output: "conv3_4/x1/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_4/x1/bn"
  output: "conv3_4/x1/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_4/x1/bn"
  input: "conv3_4/x1_w"
  output: "conv3_4/x1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_4/x1"
  input: "conv3_4/x2/bn_scale"
  input: "conv3_4/x2/bn_bias"
  input: "conv3_4/x2/bn_mean"
  input: "conv3_4/x2/bn_var"
  output: "conv3_4/x2/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_4/x2/bn"
  input: "conv3_4/x2/bn_w"
  output: "conv3_4/x2/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_4/x2/bn_internal"
  input: "conv3_4/x2/bn_b"
  output: "conv3_4/x2/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_4/x2/bn"
  output: "conv3_4/x2/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_4/x2/bn"
  input: "conv3_4/x2_w"
  output: "conv3_4/x2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  device_option {
  }
  engine: ""
}
op {
  input: "concat_3_3"
  input: "conv3_4/x2"
  output: "concat_3_4"
  output: "_concat_3_4_dims"
  type: "Concat"
  device_option {
  }
  engine: ""
}
op {
  input: "concat_3_4"
  input: "conv3_5/x1/bn_scale"
  input: "conv3_5/x1/bn_bias"
  input: "conv3_5/x1/bn_mean"
  input: "conv3_5/x1/bn_var"
  output: "conv3_5/x1/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_5/x1/bn"
  input: "conv3_5/x1/bn_w"
  output: "conv3_5/x1/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_5/x1/bn_internal"
  input: "conv3_5/x1/bn_b"
  output: "conv3_5/x1/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_5/x1/bn"
  output: "conv3_5/x1/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_5/x1/bn"
  input: "conv3_5/x1_w"
  output: "conv3_5/x1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_5/x1"
  input: "conv3_5/x2/bn_scale"
  input: "conv3_5/x2/bn_bias"
  input: "conv3_5/x2/bn_mean"
  input: "conv3_5/x2/bn_var"
  output: "conv3_5/x2/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_5/x2/bn"
  input: "conv3_5/x2/bn_w"
  output: "conv3_5/x2/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_5/x2/bn_internal"
  input: "conv3_5/x2/bn_b"
  output: "conv3_5/x2/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_5/x2/bn"
  output: "conv3_5/x2/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_5/x2/bn"
  input: "conv3_5/x2_w"
  output: "conv3_5/x2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  device_option {
  }
  engine: ""
}
op {
  input: "concat_3_4"
  input: "conv3_5/x2"
  output: "concat_3_5"
  output: "_concat_3_5_dims"
  type: "Concat"
  device_option {
  }
  engine: ""
}
op {
  input: "concat_3_5"
  input: "conv3_6/x1/bn_scale"
  input: "conv3_6/x1/bn_bias"
  input: "conv3_6/x1/bn_mean"
  input: "conv3_6/x1/bn_var"
  output: "conv3_6/x1/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_6/x1/bn"
  input: "conv3_6/x1/bn_w"
  output: "conv3_6/x1/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_6/x1/bn_internal"
  input: "conv3_6/x1/bn_b"
  output: "conv3_6/x1/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_6/x1/bn"
  output: "conv3_6/x1/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_6/x1/bn"
  input: "conv3_6/x1_w"
  output: "conv3_6/x1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_6/x1"
  input: "conv3_6/x2/bn_scale"
  input: "conv3_6/x2/bn_bias"
  input: "conv3_6/x2/bn_mean"
  input: "conv3_6/x2/bn_var"
  output: "conv3_6/x2/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_6/x2/bn"
  input: "conv3_6/x2/bn_w"
  output: "conv3_6/x2/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_6/x2/bn_internal"
  input: "conv3_6/x2/bn_b"
  output: "conv3_6/x2/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_6/x2/bn"
  output: "conv3_6/x2/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_6/x2/bn"
  input: "conv3_6/x2_w"
  output: "conv3_6/x2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  device_option {
  }
  engine: ""
}
op {
  input: "concat_3_5"
  input: "conv3_6/x2"
  output: "concat_3_6"
  output: "_concat_3_6_dims"
  type: "Concat"
  device_option {
  }
  engine: ""
}
op {
  input: "concat_3_6"
  input: "conv3_7/x1/bn_scale"
  input: "conv3_7/x1/bn_bias"
  input: "conv3_7/x1/bn_mean"
  input: "conv3_7/x1/bn_var"
  output: "conv3_7/x1/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_7/x1/bn"
  input: "conv3_7/x1/bn_w"
  output: "conv3_7/x1/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_7/x1/bn_internal"
  input: "conv3_7/x1/bn_b"
  output: "conv3_7/x1/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_7/x1/bn"
  output: "conv3_7/x1/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_7/x1/bn"
  input: "conv3_7/x1_w"
  output: "conv3_7/x1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_7/x1"
  input: "conv3_7/x2/bn_scale"
  input: "conv3_7/x2/bn_bias"
  input: "conv3_7/x2/bn_mean"
  input: "conv3_7/x2/bn_var"
  output: "conv3_7/x2/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_7/x2/bn"
  input: "conv3_7/x2/bn_w"
  output: "conv3_7/x2/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_7/x2/bn_internal"
  input: "conv3_7/x2/bn_b"
  output: "conv3_7/x2/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_7/x2/bn"
  output: "conv3_7/x2/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_7/x2/bn"
  input: "conv3_7/x2_w"
  output: "conv3_7/x2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  device_option {
  }
  engine: ""
}
op {
  input: "concat_3_6"
  input: "conv3_7/x2"
  output: "concat_3_7"
  output: "_concat_3_7_dims"
  type: "Concat"
  device_option {
  }
  engine: ""
}
op {
  input: "concat_3_7"
  input: "conv3_8/x1/bn_scale"
  input: "conv3_8/x1/bn_bias"
  input: "conv3_8/x1/bn_mean"
  input: "conv3_8/x1/bn_var"
  output: "conv3_8/x1/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_8/x1/bn"
  input: "conv3_8/x1/bn_w"
  output: "conv3_8/x1/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_8/x1/bn_internal"
  input: "conv3_8/x1/bn_b"
  output: "conv3_8/x1/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_8/x1/bn"
  output: "conv3_8/x1/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_8/x1/bn"
  input: "conv3_8/x1_w"
  output: "conv3_8/x1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_8/x1"
  input: "conv3_8/x2/bn_scale"
  input: "conv3_8/x2/bn_bias"
  input: "conv3_8/x2/bn_mean"
  input: "conv3_8/x2/bn_var"
  output: "conv3_8/x2/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_8/x2/bn"
  input: "conv3_8/x2/bn_w"
  output: "conv3_8/x2/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_8/x2/bn_internal"
  input: "conv3_8/x2/bn_b"
  output: "conv3_8/x2/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_8/x2/bn"
  output: "conv3_8/x2/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_8/x2/bn"
  input: "conv3_8/x2_w"
  output: "conv3_8/x2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  device_option {
  }
  engine: ""
}
op {
  input: "concat_3_7"
  input: "conv3_8/x2"
  output: "concat_3_8"
  output: "_concat_3_8_dims"
  type: "Concat"
  device_option {
  }
  engine: ""
}
op {
  input: "concat_3_8"
  input: "conv3_9/x1/bn_scale"
  input: "conv3_9/x1/bn_bias"
  input: "conv3_9/x1/bn_mean"
  input: "conv3_9/x1/bn_var"
  output: "conv3_9/x1/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_9/x1/bn"
  input: "conv3_9/x1/bn_w"
  output: "conv3_9/x1/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_9/x1/bn_internal"
  input: "conv3_9/x1/bn_b"
  output: "conv3_9/x1/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_9/x1/bn"
  output: "conv3_9/x1/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_9/x1/bn"
  input: "conv3_9/x1_w"
  output: "conv3_9/x1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_9/x1"
  input: "conv3_9/x2/bn_scale"
  input: "conv3_9/x2/bn_bias"
  input: "conv3_9/x2/bn_mean"
  input: "conv3_9/x2/bn_var"
  output: "conv3_9/x2/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_9/x2/bn"
  input: "conv3_9/x2/bn_w"
  output: "conv3_9/x2/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_9/x2/bn_internal"
  input: "conv3_9/x2/bn_b"
  output: "conv3_9/x2/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_9/x2/bn"
  output: "conv3_9/x2/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_9/x2/bn"
  input: "conv3_9/x2_w"
  output: "conv3_9/x2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  device_option {
  }
  engine: ""
}
op {
  input: "concat_3_8"
  input: "conv3_9/x2"
  output: "concat_3_9"
  output: "_concat_3_9_dims"
  type: "Concat"
  device_option {
  }
  engine: ""
}
op {
  input: "concat_3_9"
  input: "conv3_10/x1/bn_scale"
  input: "conv3_10/x1/bn_bias"
  input: "conv3_10/x1/bn_mean"
  input: "conv3_10/x1/bn_var"
  output: "conv3_10/x1/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_10/x1/bn"
  input: "conv3_10/x1/bn_w"
  output: "conv3_10/x1/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_10/x1/bn_internal"
  input: "conv3_10/x1/bn_b"
  output: "conv3_10/x1/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_10/x1/bn"
  output: "conv3_10/x1/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_10/x1/bn"
  input: "conv3_10/x1_w"
  output: "conv3_10/x1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_10/x1"
  input: "conv3_10/x2/bn_scale"
  input: "conv3_10/x2/bn_bias"
  input: "conv3_10/x2/bn_mean"
  input: "conv3_10/x2/bn_var"
  output: "conv3_10/x2/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_10/x2/bn"
  input: "conv3_10/x2/bn_w"
  output: "conv3_10/x2/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_10/x2/bn_internal"
  input: "conv3_10/x2/bn_b"
  output: "conv3_10/x2/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_10/x2/bn"
  output: "conv3_10/x2/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_10/x2/bn"
  input: "conv3_10/x2_w"
  output: "conv3_10/x2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  device_option {
  }
  engine: ""
}
op {
  input: "concat_3_9"
  input: "conv3_10/x2"
  output: "concat_3_10"
  output: "_concat_3_10_dims"
  type: "Concat"
  device_option {
  }
  engine: ""
}
op {
  input: "concat_3_10"
  input: "conv3_11/x1/bn_scale"
  input: "conv3_11/x1/bn_bias"
  input: "conv3_11/x1/bn_mean"
  input: "conv3_11/x1/bn_var"
  output: "conv3_11/x1/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_11/x1/bn"
  input: "conv3_11/x1/bn_w"
  output: "conv3_11/x1/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_11/x1/bn_internal"
  input: "conv3_11/x1/bn_b"
  output: "conv3_11/x1/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_11/x1/bn"
  output: "conv3_11/x1/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_11/x1/bn"
  input: "conv3_11/x1_w"
  output: "conv3_11/x1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_11/x1"
  input: "conv3_11/x2/bn_scale"
  input: "conv3_11/x2/bn_bias"
  input: "conv3_11/x2/bn_mean"
  input: "conv3_11/x2/bn_var"
  output: "conv3_11/x2/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_11/x2/bn"
  input: "conv3_11/x2/bn_w"
  output: "conv3_11/x2/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_11/x2/bn_internal"
  input: "conv3_11/x2/bn_b"
  output: "conv3_11/x2/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_11/x2/bn"
  output: "conv3_11/x2/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_11/x2/bn"
  input: "conv3_11/x2_w"
  output: "conv3_11/x2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  device_option {
  }
  engine: ""
}
op {
  input: "concat_3_10"
  input: "conv3_11/x2"
  output: "concat_3_11"
  output: "_concat_3_11_dims"
  type: "Concat"
  device_option {
  }
  engine: ""
}
op {
  input: "concat_3_11"
  input: "conv3_12/x1/bn_scale"
  input: "conv3_12/x1/bn_bias"
  input: "conv3_12/x1/bn_mean"
  input: "conv3_12/x1/bn_var"
  output: "conv3_12/x1/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_12/x1/bn"
  input: "conv3_12/x1/bn_w"
  output: "conv3_12/x1/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_12/x1/bn_internal"
  input: "conv3_12/x1/bn_b"
  output: "conv3_12/x1/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_12/x1/bn"
  output: "conv3_12/x1/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_12/x1/bn"
  input: "conv3_12/x1_w"
  output: "conv3_12/x1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_12/x1"
  input: "conv3_12/x2/bn_scale"
  input: "conv3_12/x2/bn_bias"
  input: "conv3_12/x2/bn_mean"
  input: "conv3_12/x2/bn_var"
  output: "conv3_12/x2/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_12/x2/bn"
  input: "conv3_12/x2/bn_w"
  output: "conv3_12/x2/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_12/x2/bn_internal"
  input: "conv3_12/x2/bn_b"
  output: "conv3_12/x2/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_12/x2/bn"
  output: "conv3_12/x2/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_12/x2/bn"
  input: "conv3_12/x2_w"
  output: "conv3_12/x2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  device_option {
  }
  engine: ""
}
op {
  input: "concat_3_11"
  input: "conv3_12/x2"
  output: "concat_3_12"
  output: "_concat_3_12_dims"
  type: "Concat"
  device_option {
  }
  engine: ""
}
op {
  input: "concat_3_12"
  input: "conv3_blk/bn_scale"
  input: "conv3_blk/bn_bias"
  input: "conv3_blk/bn_mean"
  input: "conv3_blk/bn_var"
  output: "conv3_blk/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_blk/bn"
  input: "conv3_blk/bn_w"
  output: "conv3_blk/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_blk/bn_internal"
  input: "conv3_blk/bn_b"
  output: "conv3_blk/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_blk/bn"
  output: "conv3_blk/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_blk/bn"
  input: "conv3_blk_w"
  output: "conv3_blk"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv3_blk"
  output: "pool3"
  type: "AveragePool"
  arg {
    name: "stride"
    i: 2
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 2
  }
  device_option {
  }
  engine: ""
}
op {
  input: "pool3"
  input: "conv4_1/x1/bn_scale"
  input: "conv4_1/x1/bn_bias"
  input: "conv4_1/x1/bn_mean"
  input: "conv4_1/x1/bn_var"
  output: "conv4_1/x1/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv4_1/x1/bn"
  input: "conv4_1/x1/bn_w"
  output: "conv4_1/x1/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv4_1/x1/bn_internal"
  input: "conv4_1/x1/bn_b"
  output: "conv4_1/x1/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv4_1/x1/bn"
  output: "conv4_1/x1/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv4_1/x1/bn"
  input: "conv4_1/x1_w"
  output: "conv4_1/x1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv4_1/x1"
  input: "conv4_1/x2/bn_scale"
  input: "conv4_1/x2/bn_bias"
  input: "conv4_1/x2/bn_mean"
  input: "conv4_1/x2/bn_var"
  output: "conv4_1/x2/bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 9.99999974738e-06
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv4_1/x2/bn"
  input: "conv4_1/x2/bn_w"
  output: "conv4_1/x2/bn_internal"
  type: "Mul"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv4_1/x2/bn_internal"
  input: "conv4_1/x2/bn_b"
  output: "conv4_1/x2/bn"
  type: "Add"
  arg {
    name: "axis"
    i: 1
  }
  arg {
    name: "broadcast"
    i: 1
  }
  device_option {
  }
  engine: ""
}
op {
  input: "conv4_1/x2/bn"
  output: "conv4_1/x2/bn"
  type: "Relu"
  device_option {
  }
  engine: ""
}
op {
  input: "conv4_1/x2/bn"
  input: "conv4_1/x2_w"
  output: "conv4_1/x2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  device_option {
  }
  engine: ""
}
op {
  input: "pool3"
  input: "conv4_1/x2"
  output: "concat_4_1"
  output: "_concat_4_1_dims"
  type: "Concat"
  device_option {
  }
  engine: ""
}
op {
  input: "concat_4_1"
  input: "conv4_2/x1/bn_scale"
  input: "conv4_2/x1/bn_bias"
